amirmovafagh/car-multimedia-mcu-stm32/Src/main.c

/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  ** This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * COPYRIGHT(c) 2018 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f1xx_hal.h"

/* USER CODE BEGIN Includes */
#include "stdbool.h"



/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;
DMA_HandleTypeDef hdma_adc1;

I2C_HandleTypeDef hi2c1;

IWDG_HandleTypeDef hiwdg;

TIM_HandleTypeDef htim2;

UART_HandleTypeDef huart1;
UART_HandleTypeDef huart2;

/* USER CODE BEGIN PV */
GPIO_PinState acciPinState, rcaiPinState;

	
/* Private variables ---------------------------------------------------------*/
HAL_StatusTypeDef readAdc;


char ch[20];//usart
char ch2[20];//usart
char str[20];//uint8_t str[20];

uint8_t buffer[8]={0x00, 0x00, 0x00, 0x63, 0x04, 0x23, 0x12, 0x15}; 


uint8_t bt[5];                                               //buffer for tea5767
unsigned int pllfrq;
float pll;
uint32_t frq2;
uint8_t senddata[5];
HAL_StatusTypeDef init;

int d;
int rx_index=0;
int rx2_index=0;
uint8_t rx_data;
uint8_t rx_buffer[32];
uint8_t rx2_data;
uint8_t rx2_buffer[22];
uint8_t type[3];

uint16_t soundModuleI2CAddress = 0x88;
uint16_t RadioModuleI2CAddress = 0xC0;
uint8_t mode[3]={'m','o','d'};
uint8_t rspnsReadyStatus[3]= {'M','G','1'};
uint8_t rspnsConnectingStatus[3]= {'M','G','2'};
uint8_t rspnsConnectedStatus[3]= {'M','G','3'};
uint8_t rspnsOutCallStatus[3]= {'M','G','4'};
uint8_t rspnsInCallStatus[3]= {'M','G','5'};
uint8_t rspnsOnCallStatus[3]= {'M','G','6'};
uint8_t rspnsNum[3]= {'N','U','M'};
uint8_t audio[3]={'a','u','d'};
uint8_t radio[3]={'r','a','d'};
uint8_t bluetooth[3]={'b','l','t'};
uint8_t rspnsEnterPairing[2]= {'I','I'};
uint8_t rspnsMusicStart[2]= {'M','B'};
uint8_t rspnsMusicPause[2]= {'M','P'};
uint8_t rspnsMusicStop[2]= {'M','A'};
uint8_t rspnsMusicResume[2]= {'M','R'};
uint8_t rspnsConnectToDevice[2]= {'I','V'};
uint8_t rspnsOutgoingCall[2]= {'I','R'};


uint32_t temp_val, temperature;
float vsense = 3.3/1023;

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_I2C1_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_ADC1_Init(void);
static void MX_IWDG_Init(void);
static void MX_TIM2_Init(void);
static void MX_NVIC_Init(void);

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);
                                

/* USER CODE BEGIN PFP */
void SystemClock_Config(void);

static void MX_GPIO_Init(void);
static void MX_IWDG_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_I2C1_Init(void);
static void MX_CAN_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_USB_PCD_Init(void);
static void MX_ADC1_Init(void);
static void MX_NVIC_Init(void);


bool areEqual(uint8_t arr1[], uint8_t arr2[], int i, int n);
void checkMode(void);
void checkAudio(void);
void checkRadio(void);
void bluetoothSettings(void);
void bluetoothCall(void);
void bluetoothMusic(void);
void checkBluetooth(void);
int arrayToInt(uint8_t mArr[]);
int arrayToInt_withIndex(uint8_t mArr[],int index);
bool checkDeviceI2cConnection(uint16_t DevAddress);
void tea5767Setfrequency( uint32_t frequency );


void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
	HAL_UART_Receive (&huart1, &rx_data, 1,100);
  if( huart->Instance == USART1 )
  {    
    
    if(rx_index==0 || rx_index==-1)
    {
      for(int i=0; i<32; i++)
      {
        rx_buffer[i]=0;
        //type[i] = 0;
      }
    }
    
      //if the charcter received is other than'?' ascii 0x3f, save the data in buffer
    if (rx_data != 0x3f)
    {
      rx_buffer[rx_index++] = rx_data;
      
      
    }
    else
    {
      //HAL_UART_Transmit (&huart1, rx_buffer, rx_index,100); //transmit the data via usart      
      
