amirmovafagh/car-multimedia-mcu-stm32/Src/main.c
}

/* USER CODE BEGIN 4 */
void tea5767Setfrequency( uint32_t frequency )
{
  uint32_t pllValue;
 // uint8_t buffer[5] = { 0, 0, 0, 0, 0 };
  
  // Make sure I2C is initialised
 // if (!_tea5767Initialised) tea5767Init();

  // Calculate PLL word for high side injection mode
  // NDEC = (4*(FRF + FIF)) / FREFS
  // where:
  // FRF = Desired tuning frequency in Hz
  // FIF = Intermediate frequency in Hz (225kHz)
  // FREFS = Reference frequency in Hz (32.768kHz)
  pllValue = (4 * (frequency + 225000)) / 32768;
  
 // buffer[0] = (pllValue >> 8) & 0x3F;              // Upper 6 PLL bits (also turns mute and search mode off!)
 // buffer[1] = (pllValue & 0xFF);                   // Lower 8 PLL bits
  //buffer[2] = TEA5767_WBYTE3_HLSI;                 // High side injection mode
 // buffer[3] = TEA5767_WBYTE4_XTAL;                 // XTAL bit = 1 for 32.768kHz crystal
//  buffer[4] = 0;                                   // PLLREF bit = 0 for 32.768kHz crystal

  // Send data over I2C
  bt[0]=(pllValue >> 8) & 0x3F;
   bt[1]=(pllValue & 0xFF);
		// bt[0]=0x2c;
   // bt[1]=0x37;
    bt[2]=176;
    bt[3]=16;
    bt[4]=0;
		
		senddata[0]= bt[0];
		senddata[1]= bt[1];
		senddata[2]= bt[2];
		senddata[3]= bt[3];
		senddata[4]= bt[4];
		

		
		
	HAL_I2C_Master_Transmit(&hi2c1,RadioModuleI2CAddress,bt,5,2);	
	
}
/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  file: The file name as string.
  * @param  line: The line in file as a number.
  * @retval None
  */
void _Error_Handler(char *file, int line)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  while(1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t* file, uint32_t line)
{ 
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
